性能测试jmeter脚本/业务流程/statistics.json
{
  "小说详情" : {
    "transaction" : "小说详情",
    "sampleCount" : 66269,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 52.04964613922002,
    "medianResTime" : 75.0,
    "minResTime" : 5.0,
    "maxResTime" : 244.0,
    "pct1ResTime" : 98.0,
    "pct2ResTime" : 104.0,
    "pct3ResTime" : 121.0,
    "throughput" : 152.73789164596175,
    "receivedKBytesPerSec" : 102.78769234054703,
    "sentKBytesPerSec" : 0.0
  },
  "登录" : {
    "transaction" : "登录",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 43.29999999999999,
    "medianResTime" : 40.5,
    "minResTime" : 14.0,
    "maxResTime" : 126.0,
    "pct1ResTime" : 76.19999999999999,
    "pct2ResTime" : 98.24999999999989,
    "pct3ResTime" : 126.0,
    "throughput" : 0.13790782792412865,
    "receivedKBytesPerSec" : 0.0554594175187072,
    "sentKBytesPerSec" : 0.0
  },
  "浏览+评论业务" : {
    "transaction" : "浏览+评论业务",
    "sampleCount" : 706,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 278.0028328611899,
    "medianResTime" : 277.0,
    "minResTime" : 38.0,
    "maxResTime" : 654.0,
    "pct1ResTime" : 432.30000000000007,
    "pct2ResTime" : 459.65,
    "pct3ResTime" : 510.78999999999985,
    "throughput" : 1.6308993046732427,
    "receivedKBytesPerSec" : 28.431375645371805,
    "sentKBytesPerSec" : 0.0
  },
  "小说列表" : {
    "transaction" : "小说列表",
    "sampleCount" : 66287,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 45.04604221038821,
    "medianResTime" : 64.0,
    "minResTime" : 5.0,
    "maxResTime" : 223.0,
    "pct1ResTime" : 84.0,
    "pct2ResTime" : 90.0,
    "pct3ResTime" : 104.0,
    "throughput" : 152.77268819732055,
    "receivedKBytesPerSec" : 560.2153875638695,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 265866,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 46.59055313579102,
    "medianResTime" : 63.0,
    "minResTime" : 3.0,
    "maxResTime" : 274.0,
    "pct1ResTime" : 89.0,
    "pct2ResTime" : 96.0,
    "pct3ResTime" : 113.0,
    "throughput" : 612.6227015069818,
    "receivedKBytesPerSec" : 2607.946736276729,
    "sentKBytesPerSec" : 0.0
  },
  "章节目录" : {
    "transaction" : "章节目录",
    "sampleCount" : 66257,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 52.53090239521932,
    "medianResTime" : 76.0,
    "minResTime" : 5.0,
    "maxResTime" : 252.0,
    "pct1ResTime" : 98.0,
    "pct2ResTime" : 105.0,
    "pct3ResTime" : 120.0,
    "throughput" : 152.70917794674526,
    "receivedKBytesPerSec" : 450.64171907807395,
    "sentKBytesPerSec" : 0.0
  },
  "小说正文" : {
    "transaction" : "小说正文",
    "sampleCount" : 66247,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 36.24930940268985,
    "medianResTime" : 52.0,
    "minResTime" : 3.0,
    "maxResTime" : 210.0,
    "pct1ResTime" : 70.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 87.0,
    "throughput" : 152.69035298998537,
    "receivedKBytesPerSec" : 1493.4294685378804,
    "sentKBytesPerSec" : 0.0
  },
  "写评论" : {
    "transaction" : "写评论",
    "sampleCount" : 706,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 88.7974504249291,
    "medianResTime" : 85.0,
    "minResTime" : 16.0,
    "maxResTime" : 203.0,
    "pct1ResTime" : 145.0,
    "pct2ResTime" : 154.0,
    "pct3ResTime" : 172.0,
    "throughput" : 1.6309934968177144,
    "receivedKBytesPerSec" : 0.6355027873875226,
    "sentKBytesPerSec" : 0.0
  },
  "浏览业务" : {
    "transaction" : "浏览业务",
    "sampleCount" : 65581,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 185.77967704060688,
    "medianResTime" : 269.0,
    "minResTime" : 10.0,
    "maxResTime" : 618.0,
    "pct1ResTime" : 325.0,
    "pct2ResTime" : 341.0,
    "pct3ResTime" : 374.0,
    "throughput" : 151.14416555081044,
    "receivedKBytesPerSec" : 2579.201341814705,
    "sentKBytesPerSec" : 0.0
  }
}